k2p_same_fresh_referee_2026-08-27_r4/independent_checks/computation/entrypoint_optimized/driver_semantic_mutation/mutation_payload/input_lock.patch
--- isolated/k2p_principal_d_plus_submission_referee/package/referee/k2p_offline_sweep_portable/INPUT_LOCK.json	2026-08-27 00:00:00
+++ independent_checks/computation/entrypoint_optimized/driver_semantic_mutation/mutation_payload/INPUT_LOCK.mutated.json	2026-08-27 18:20:57
@@ -1,6 +1,6 @@
 {
   "canonicalizer_sha256": "517a056cca7a2973d9b64646630671dfcfaf9fd2c8e2335e4f24d7efec9630f5",
-  "compiler_sha256": "37e9b7910f7723c146a87ae2f60dfb62529b1a3e4866ccd72d65dc4efda923ad",
+  "compiler_sha256": "b46c5394cc6367d00e5ca7dbb9ab6c122b8d6b69ef4730d11695f159aae8937a",
   "dependency_versions": {
     "networkx": "3.5",
     "sympy": "1.14.0"
@@ -23,7 +23,7 @@
   ],
   "files": {
     "atlas/descriptors_4.pkl": "0f12f60c0eaa60fe8bea060bc0f933411cb3df61e857a940e0ec9e21cab19127",
-    "atlas/k2p_atlas_core.py": "37e9b7910f7723c146a87ae2f60dfb62529b1a3e4866ccd72d65dc4efda923ad",
+    "atlas/k2p_atlas_core.py": "b46c5394cc6367d00e5ca7dbb9ab6c122b8d6b69ef4730d11695f159aae8937a",
     "atlas/rank_certs_4.pkl": "1ad9b5878f97cdf5deafc6a3e5f0e09ec95a63b4da829ba3aac0afead48acde5",
     "certificates/direct_hard_cases.json": "beb84b9b5777c4dde950b351ad60c448630e7f33ae3f530728a68f643e2b29fd",
     "compare_semantic_runs.py": "d015b8c91e2a4de68162eed0ed26d1c6bbfccac4ab0ef52dd0ac7957049a7b44",
